{"id":5171,"date":"2020-06-30T16:02:48","date_gmt":"2020-06-30T20:02:48","guid":{"rendered":"https:\/\/softwaremechanics.net\/?page_id=5171"},"modified":"2020-06-30T16:02:48","modified_gmt":"2020-06-30T20:02:48","slug":"refund-and-cancellation-policy","status":"publish","type":"page","link":"https:\/\/softwaremechanics.net\/refund-and-cancellation-policy","title":{"rendered":"Refund and Cancellation Policy"},"content":{"rendered":"<h2>Refund and Cancellation Policy<\/h2>\n<p>Full refund will be made if you secede to cancel our services within 5 days of making the payment.<br \/>\nIf you choose to terminate our services after the initial 5 days then you will be charged an amount equivalent to the working hours put into the project. The balance will be credited to the account from which you made payment within 45 days of cancellation.<br \/>\nCancellation of any service renewal should be done 10 days prior to the start of next billing cycle.<br \/>\nIf cancellations are made after the start of the billing cycle then an amount equivalent to the working hours put into the project during that month will be billable, which the clients will be entitled to pay.<br \/>\nIf you signed up for our services, but did not make use of them then you are still entitled to pay us.<br \/>\nAmount of refund will be credited in the account from which the payment was made within 45 days of service cancellation.<\/p>\n<h2>SEO Refund Policy<\/h2>\n<p>Software Mechanics will not be liable for refund or guarantee of top search ranking under the following circumstances:<\/p>\n<p>In case of effect on SEO ranking due to changes in ranking algorithm, policies or functionality of search engines.<br \/>\nLink building, a part of SEO, is carried out based on the information you provide us. In case the URLs given by you are incorrect, we will not be responsible for any subsequent errors and there will be not be any refunds or money back guarantee.<br \/>\nSoftware Mechanics will not be responsible for SEO results if the client engages with any other third party SEO services.<br \/>\nNumber of times and rank of a website appearing on the search list varies and thus an immediate change in the search ranking cannot be guaranteed.<\/p>\n<p>Any adverse effect on ranking due to changes in website content by the client or third party service provider hired by them.<br \/>\nWe make no guarantee that our SEO services will show the client’s website in top ten search rank. However, understand that we work in your best interest and put in our best effort to provide genuinely profitable results. Our aim is to make your life simpler and your business more lucrative.<\/p>\n<p>*Software Mechanics reserves the right to change the above refund and cancellation policy at any given point without any prior notice.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Refund and Cancellation Policy Full refund will be made if you secede to cancel our services within 5 days of making the payment. If you choose to terminate our services after the initial 5 days then you will be charged an amount equivalent to the working hours put into the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/softwaremechanics.net\/wp-json\/wp\/v2\/pages\/5171"}],"collection":[{"href":"https:\/\/softwaremechanics.net\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/softwaremechanics.net\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/softwaremechanics.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/softwaremechanics.net\/wp-json\/wp\/v2\/comments?post=5171"}],"version-history":[{"count":0,"href":"https:\/\/softwaremechanics.net\/wp-json\/wp\/v2\/pages\/5171\/revisions"}],"wp:attachment":[{"href":"https:\/\/softwaremechanics.net\/wp-json\/wp\/v2\/media?parent=5171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}